---
kind: method
id: M:Autodesk.Revit.DB.FabricationConfiguration.GetFabricationConfiguration(Autodesk.Revit.DB.Document)
source: html/041695a6-1434-bb23-6105-5783458b8ceb.htm
---
# Autodesk.Revit.DB.FabricationConfiguration.GetFabricationConfiguration Method

Gets the fabrication configuration element in the document.

## Syntax (C#)
```csharp
public static FabricationConfiguration GetFabricationConfiguration(
	Document document
)
```

## Parameters
- **document** (`Autodesk.Revit.DB.Document`) - The document.

## Returns
The fabrication configuration element in the document.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null